from django.shortcuts import render
import random


# Список случайных кличек
PET_NAMES = [
    "Барсик", "Мурка", "Рекс", "Шарик", "Боня", "Лаки", "Грей", "Персик", "Снежок", "Чарли",
    "Белка", "Кузя", "Луна", "Рыжик", "Кнопка", "Сима", "Лея", "Пушок", "Арчи", "Малыш",
    "Феня", "Тоша", "Тайга", "Лорд", "Марта", "Бакс", "Злата", "Гуччи", "Хан", "Софи",
    "Тима", "Кекс", "Жужа", "Боско", "Фиби", "Байкал", "Миша", "Гром", "Альма", "Ронда",
    "Ника", "Чита", "Филя", "Эльза", "Пуля", "Яша", "Рик", "Фокс", "Гриня", "Трикси"
]

def random_pet_name_view(request):
    """ Отображает случайное имя для питомца"""
    random_name = random.choice(PET_NAMES)
    return render(request, 'random_pet_name/random_name.html', {'pet_name': random_name})
